1、一级索引
主键索引是聚簇索引，也是一级索引，B+树中非叶子节点只存储主键值，叶子节点存储主键值+数据，
叶子节点内各个主键的键值对通过链表连接。

          [非叶子节点]                        
+-------------------------------+  
| 键1 | 键2 | ... | 键N | 指针1..N+1 |  
+-------------------------------+  
/       |            \  
[叶子节点]              [叶子节点]  
+-------------------------------+  
| 主键1 | 行数据1 | ... | 主键N | 行数据N |  
+-------------------------------+

2、二级索引
唯一索引、普通索引、联合索引都属于二级索引。在二级索引中，非叶子节点只存储索引键（即索引字段值），
叶子节点存储索引键和对应的主键。因此二级索引通过索引字段值找到对应的主键后，还需要去一级索引中根据主键找对应的数据行。
即需要进行回表操作。

          [非叶子节点]                        
+-------------------------------+  
| 索引键1 | ... | 索引键N | 指针1..N+1 |  
+-------------------------------+  
/       |            \  
[叶子节点]              [叶子节点]  
+-------------------------------+  
| 索引键1 | 主键1 | ... | 索引键N | 主键N |  
+-------------------------------+  